[
{"match": "1st Test, Pakistan tour of South Africa at Centurion, Dec 26-30 2018"},
{"over": "55.6", "commentary": "Olivier to Shaheen Shah Afridi, "},
{"over": "55.5", "commentary": "Olivier to Shaheen Shah Afridi, "},
{"over": "55.4", "commentary": "Olivier to Shaheen Shah Afridi, no run, length ball, and he winds up and looks to smash this towards midwicket. It takes the top of the blade and falls limply over to the off side!"},
{"over": "55.3", "commentary": "Olivier to Shaheen Shah Afridi, no run, angles across him from a length, and he misses out on an attempted steer towards third man"},
{"over": "55.2", "commentary": "Olivier to Shaheen Shah Afridi, no run, short ball, angles across him, and he lets it pass"},
{"over": "55.1", "commentary": "Olivier to Hasan Ali, 1 run, length ball, and he moves across to the on side and hoicks it across the line towards midwicket"},
{"over": "54.6", "commentary": "Steyn to Shaheen Shah Afridi, no run, length ball, and he goes back to defend"},
{"over": "54.5", "commentary": "Steyn to Shaheen Shah Afridi, no run, length ball, straightens into him at 142kph, and he goes back to defend"},
{"over": "54.4", "commentary": "Steyn to Shaheen Shah Afridi, no run, pitched up, and he defends a straight ball from the crease"},
{"over": "54.3", "commentary": "Steyn to Shaheen Shah Afridi, no run, short, and moves away sharply, bowled at 141kph, and Afridi lets this pass"},
{"over": "54.2", "commentary": "Steyn to Shan Masood, "},
{"over": "54.1", "commentary": "Steyn to Shan Masood, no run, straight ball, and he drives it down the ground towards mid on"},
{"over": "53.6", "commentary": "Olivier to Hasan Ali, no run, length ball, angles across him, bowled at 138kph, and beats the outside edge as Hasan Ali looks to defend this"},
{"over": "53.5", "commentary": "Olivier to Hasan Ali, 2 runs, fuller, and he drives it down the ground this time. Gorgeous bit of timing, but Bavuma gets to it. Only just, but does well!"},
{"over": "53.4", "commentary": "Olivier to Hasan Ali, no run, short, and he ducks under it again"},
{"over": "53.3", "commentary": "Olivier to Hasan Ali, "},
{"over": "53.2", "commentary": "Olivier to Hasan Ali, no run, short, and better directed this time. Ali ducks, and "},
{"over": "53.1", "commentary": "Olivier to Hasan Ali, no run, short ball, and Ali ducks inside it. Clumsy, but effective!"},
{"match": "2nd Test, Sri Lanka tour of New Zealand at Christchurch, Dec 26-30 2018"},
{"match": "3rd Test, India tour of Australia at Melbourne, Dec 26-30 2018"},
{"over": "138.3", "commentary": "Chameera to Latham, "},
{"over": "40.2", "commentary": "Mohammed Shami to MR Marsh, no run, "},
{"over": "40.1", "commentary": "Mohammed Shami to MR Marsh, no run, back of a length and just a shade outside off, blocked to short cover off the back foot"},
{"over": "39.6", "commentary": "Jadeja to Paine, no run, tossed fuller and outside off, defended off the front foot"},
{"over": "39.5", "commentary": "Jadeja to Paine, no run, tossed outside off, defended to silly-point with soft hands"},
{"over": "39.4", "commentary": "Jadeja to Paine, no run, back of a length and angling into top of off, punched back to the bowler"},
{"over": "39.3", "commentary": "Jadeja to Paine, no run, skids on with the arm, "},
{"over": "39.2", "commentary": "Jadeja to MR Marsh, 3 runs, darted onto the pads, glanced away through backward square leg"},
{"over": "138.2", "commentary": "Chameera to Latham, "},
{"over": "138.1", "commentary": "Chameera to Latham, no run, fuller outside off, looks to drive it through covers, gets beaten"},
{"over": "137.6", "commentary": "Gunathilaka to Nicholls, "},
{"over": "137.5", "commentary": "Gunathilaka to Nicholls, 2 runs, short of length, whipped towards midwicket for a couple more"},
{"over": "39.1", "commentary": "Jadeja to MR Marsh, no run, flatter and outside off, blocked to cover"},
{"over": "38.6", "commentary": "Bumrah to MR Marsh, 1 run, another Australia batsman "},
{"over": "38.5", "commentary": "Bumrah to MR Marsh, no run, pitched up and outside off, patted to the covers"},
{"over": "38.4", "commentary": "Bumrah to MR Marsh, no run, really full and bends back in at off again, Marsh digs it out to the off side"},
{"over": "38.3", "commentary": "Bumrah to MR Marsh, no run, on a length and slanting in at off, does not bounce much, defended into the covers"},
{"over": "38.2", "commentary": "Bumrah to MR Marsh, no run, full and bends back in at off, dragged to mid-on off the inside half"},
{"over": "137.4", "commentary": "Gunathilaka to Nicholls, no run, fuller, wide outside off, left alone"},
{"over": "137.3", "commentary": "Gunathilaka to Nicholls, "},
{"over": "137.2", "commentary": "Gunathilaka to Nicholls, no run, length around middle, worked towards short midwicket"},
{"over": "137.1", "commentary": "Gunathilaka to Latham, 1 run, length around off, waits for it before guiding it towards covers, "},
{"over": "136.6", "commentary": "Chameera to Nicholls, no run, fuller outside off, hits it towards covers, a good stop there by the fielder towards his left"},
{"over": "136.5", "commentary": "Chameera to Nicholls, no run, length outside off, stands tall and punches it firmly but straight to extra cover"},
{"over": "136.4", "commentary": "Chameera to Nicholls, no run, a touch fuller outside off, defended"},
{"over": "38.1", "commentary": "Bumrah to Paine, 1 run, back of a length and outside off, tipped behind point for one"},
{"over": "37.6", "commentary": "Jadeja to MR Marsh, no run, slides on middle, Marsh pushes to the off side"},
{"over": "37.5", "commentary": "Jadeja to MR Marsh, no run, dangled up outside off, Marsh backs away a touch and lashes the ball to short cover. Can't get it past Kohli"},
{"over": "37.4", "commentary": "Jadeja to MR Marsh, no run, shorter and outside off, Marsh goes back and punches it back to the bowler"},
{"over": "37.3", "commentary": "Jadeja to MR Marsh, no run, skids on off, keeps low as well, played back to the bowler again"},
{"over": "136.3", "commentary": "Chameera to Nicholls, no run, short of length around off at 124.5 kph, pushed towards short midwicket"},
{"over": "136.2", "commentary": "Chameera to Nicholls, no run, length outside off, not much feet movement, defended back though"},
{"over": "136.1", "commentary": "Chameera to Latham, 1 run, short of length outside off, steers it towards third man"},
{"over": "135.6", "commentary": "Gunathilaka to Nicholls, no run, short of length on the stumps, punched towards short midwicket"},
{"over": "135.5", "commentary": "Gunathilaka to Nicholls, no run, tossed up outside off, Nicholls pushes at it and gets beaten by the turn"},
{"over": "135.4", "commentary": "Gunathilaka to Latham, 1 run, short of length, goes back and works it towards long-on"}
]